app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Rails Introduction Quiz edited"], ["description", "asdfasdf blah"], ["updated_at", "2018-11-03 19:36:19.747312"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(title: params[:post][:title], description: params[:post][:description])